---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures
source: html/dd78d3de-0f9a-0e0e-7b9f-70ce113193b6.htm
---
# BuiltInFailures.ConnectorFailures Properties

The center of the Air Terminal doesn't align at (0,0,0): align the Air Terminal Center to the Origin Defining Reference Planes could help to solve the problem.